import {FIO, Resource, Status, Task, TaskType} from "../models/types";

export type Course = {
  id: string
  name: string
  authors: FIO[]
  teachers: FIO[]
  tasks: Task[]
  resources: Resource[]
}

export const CourseMock: Course = {
  id: '0',
  name: 'Концепции и модели физики. Механика',
  authors: [
    {
      surname: 'Иван',
      name: 'Иванов',
      patronymic: 'Иванович',
    },
    {
      surname: 'Сидоров',
      name: 'Роман',
    },
  ],
  teachers: [
    {
      surname: 'Колесников',
      name: 'Михаил',
      patronymic: 'Юрьевич',
    },
  ],
  tasks: [
    {
      id: '0',
      name: 'Кинематика материальной точки',
      period: [new Date(2021, 0, 1), new Date(2021, 1, 28)],
      countOfTry: [4, 10],
      status: Status.FOUR,
      type: TaskType.TEST,
    },
    {
      id: '1',
      name: 'Динамика материальной точки',
      period: [new Date(2021, 0, 1), new Date(2021, 1, 28)],
      countOfTry: [4, 10],
      status: Status.DONE,
      type: TaskType.MANUAL_CHECK,
    },
    {
      id: '2',
      name: 'Динамика системы частиц',
      period: [new Date(2021, 0, 1), new Date(2021, 1, 28)],
      countOfTry: [4, 10],
      status: Status.WAITING,
      type: TaskType.AUTOMATIC_CHECK,
    },
  ],
  resources: [
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
  ],
}
