import { FIO, Resource, TaskType } from '../models/types'

type DeadLine = {
  five: Date
  four: Date
}

export enum TaskStatus {
  FIVE = 'ОТЛИЧНО',
  FOUR = 'ХОРОШО',
  DONE = 'СДАНО',
  WAITING = 'НЕ СДАНО',
}

export type Task = {
  id: string
  name: string
  courseName: string
  courseID: string
  status: TaskStatus
  statusDate: Date | null
  teacher: FIO
  type: TaskType
  deadline?: DeadLine
  countOfTry: [number, number]
  resources: Resource[]
}

export type TryHistory = {
  id: string
  date: Date
  file: string
  comment: string
  status: TaskStatus
}

export const TaskMock: Task = {
  id: '0',
  name: 'Кинематика материальной точки',
  courseName: 'Концепции и модели физики. Механика',
  courseID: '0',
  status: TaskStatus.FIVE,
  statusDate: new Date(2021, 2, 5),
  teacher: {
    surname: 'Колесников',
    name: 'Михаил',
    patronymic: 'Юрьевич',
  },
  type: TaskType.AUTOMATIC_CHECK,
  deadline: {
    five: new Date(2021, 2, 8),
    four: new Date(2021, 3, 10),
  },
  countOfTry: [4, 10],
  resources: [
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF ',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
    'Механика, Черкасов А. В., Бочаров Т.К., БГТУ им. Шухова, 2005г. PDF',
  ],
}

export const tryHistoryMock: TryHistory[] = [
  {
    id: '0',
    date: new Date(2021, 2, 5),
    file: 'hello-world.go',
    comment: '',
    status: TaskStatus.FIVE,
  },
  {
    id: '1',
    date: new Date(2021, 2, 4),
    file: 'hello-world.go',
    comment:
      'иногда нужно определять новый тип ошибки, который содержит исходную ошибку, чтобы сохранить её для анализа с помощью кода',
    status: TaskStatus.WAITING,
  },
  {
    id: '2',
    date: new Date(2021, 2, 3),
    file: 'hello-world.go',
    comment: 'на этапе статического анализа',
    status: TaskStatus.WAITING,
  },
  {
    id: '3',
    date: new Date(2021, 2, 2),
    file: 'hello-world.go',
    comment: 'на этапе компиляции',
    status: TaskStatus.WAITING,
  },
  {
    id: '4',
    date: new Date(2021, 2, 1),
    file: 'hello-world.go',
    comment: '',
    status: TaskStatus.WAITING,
  },
]
